src/cf/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment> Полное наименование, например, для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment> Код производителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment> Ставка НДС по умолчанию для оформления документов</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment> Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГТД</Name>
					<Comment> Номер ГТД по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяСпецификацияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпецификацииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Импортер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТНВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторВидовЭкономическойДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбщероссийскийКлассификаторПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/Номенклатура/Forms/ФормаЦен/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ДатаЦены = ТекущаяДата(); 
    ЗаполнитьТаблицуЦен()
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаЦенПриИзменении(Элемент)
    ЗаполнитьТаблицуЦен()
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЦеныНоменклатуры

&НаКлиенте
Процедура ЦеныНоменклатурыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
    
    // После редактировании строки автоматически установим в этой строке флажок "Записать".
    Элементы.ЦеныНоменклатуры.ТекущиеДанные.Записать = Не ОтменаРедактирования;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийКомандФормы

&НаКлиенте
Процедура ЗаписатьЦены(Команда)
    СтрокиДляЗаписи = ЦеныНоменклатуры.НайтиСтроки(Новый Структура("Записать", Истина));
    
    ТекстСообщения = "";
    НачалоПредупреждения = "Не указано значение цены для записи (тип цен ";
    Для Каждого Строка Из СтрокиДляЗаписи Цикл
        Если Не ЗначениеЗаполнено(Строка.Цена) Тогда
            ТекстСообщения = ТекстСообщения + НачалоПредупреждения + Строка.ТипЦен + ")
            |";
        КонецЕсли;
    КонецЦикла;
    Если ЗначениеЗаполнено(ТекстСообщения) Тогда
        ПоказатьПредупреждение( , ТекстСообщения);
        Возврат;
    КонецЕсли;
    
    ЗаписатьЦеныНаСервере()
    
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЦены(Команда)
    ЗаполнитьТаблицуЦен()
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ЗаполнитьЦены(НоменклатураЦен,ДатаЦен)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", ДатаЦен);
	Запрос.УстановитьПараметр("Ссылка", НоменклатураЦен);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТипыЦенНоменклатуры.Ссылка КАК ТипЦен,
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
	|	ЛОЖЬ КАК Записать,
	|	ВЫБОР
	|		КОГДА ЦеныНоменклатурыСрезПоследних.Валюта ЕСТЬ NULL 
	|			ТОГДА ТипыЦенНоменклатуры.ВалютаЦены
	|		ИНАЧЕ ЦеныНоменклатурыСрезПоследних.Валюта
	|	КОНЕЦ КАК Валюта,
	|	ВЫБОР
	|		КОГДА ЦеныНоменклатурыСрезПоследних.Регистратор ЕСТЬ NULL 
	|			ТОГДА МАКСИМУМ(ЦеныНоменклатурыСрезПоследних1.Регистратор)
	|		ИНАЧЕ ЦеныНоменклатурыСрезПоследних.Регистратор
	|	КОНЕЦ КАК Документ
	|ИЗ
	|	Справочник.ТипыЦенНоменклатуры КАК ТипыЦенНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, Номенклатура = &Ссылка) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО (ЦеныНоменклатурыСрезПоследних.ТипЦен = ТипыЦенНоменклатуры.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, ) КАК ЦеныНоменклатурыСрезПоследних1
	|		ПО (ЦеныНоменклатурыСрезПоследних1.ТипЦен = ТипыЦенНоменклатуры.Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТипыЦенНоменклатуры.Ссылка,
	|	ЦеныНоменклатурыСрезПоследних.Цена,
	|	ЦеныНоменклатурыСрезПоследних.Валюта,
	|	ЦеныНоменклатурыСрезПоследних.Регистратор,
	|	ВЫБОР
	|		КОГДА ЦеныНоменклатурыСрезПоследних.Валюта ЕСТЬ NULL 
	|			ТОГДА ТипыЦенНоменклатуры.ВалютаЦены
	|		ИНАЧЕ ЦеныНоменклатурыСрезПоследних.Валюта
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипыЦенНоменклатуры.Наименование";
	
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Процедура СоздатьДокументЦен(ДатаЦены, Строка, Номенклатура)
    ДокументОбъект = Строка.Документ;
    Если Не ЗначениеЗаполнено(ДокументОбъект) Или НЕ ДатаЦены = ДокументОбъект.Дата Тогда
        ДокументОбъект = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
        ДокументОбъект.Дата = НачалоДня(ДатаЦены);
        ДокументОбъект.ТипЦен = Строка.ТипЦен;
        СтрокаДокумента = ДокументОбъект.Товары.Добавить();
    Иначе
        ДокументОбъект = Строка.Документ.ПолучитьОбъект();
        
        Если ДокументОбъект.Товары.Найти(Номенклатура) = НЕОПРЕДЕЛЕНО Тогда
            СтрокаДокумента = ДокументОбъект.Товары.Добавить();
        Иначе
            СтрокаДокумента = ДокументОбъект.Товары.Найти(Номенклатура);
        КонецЕсли;
    КонецЕсли;    
    
    СтрокаДокумента.Номенклатура = Номенклатура;
    СтрокаДокумента.Цена = Строка.Цена;
    СтрокаДокумента.Валюта = Строка.Валюта;
    Попытка
        ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
    Исключение
        		
		ТекстСообщения = НСтр("ru='Не удалось создать документ для установки цен типа ""%1""'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Строка.ТипЦен);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		ОписаниеОшибки = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки.Описание);
		
    КонецПопытки;
    
    
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЦеныНаСервере()
    
    СтрокиДляЗаписи = ЦеныНоменклатуры.НайтиСтроки(Новый Структура("Записать", Истина));
    Для Каждого Строка Из СтрокиДляЗаписи Цикл
        ДанныеСтроки = Новый Структура("ТипЦен,Цена,Валюта,Документ",Строка.ТипЦен,Строка.Цена,Строка.Валюта,Строка.Документ);
        СоздатьДокументЦен(ДатаЦены, ДанныеСтроки, Параметры.НоменклатураЦен);
    КонецЦикла;
    
    ЗаполнитьТаблицуЦен()
    
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуЦен()
    
    Результат = ЗаполнитьЦены(Параметры.НоменклатураЦен, ДатаЦены); 
    ЗначениеВРеквизитФормы(Результат,"ЦеныНоменклатуры");
    
КонецПроцедуры

#КонецОбласти
